Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartNoPartTypeFound Property
 There are no fabrication part types found for the current Configuration and Service. Please select settings and reload the service to create the fabrication part types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartNoPartTypeFound { get; }
Public Shared ReadOnly Property FabricationPartNoPartTypeFound As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartNoPartTypeFound {
	FailureDefinitionId^ get ();
}
static member FabricationPartNoPartTypeFound : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace